Revit 2027 API
BaseImportOptions.VisibleLayersOnly Property
 Only import the visible layers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool VisibleLayersOnly { get; set; }
Public Property VisibleLayersOnly As Boolean
	Get
	Set
public:
property bool VisibleLayersOnly {
	bool get ();
	void set (bool value);
}
member VisibleLayersOnly : bool with get, set
Property Value
Boolean
Remarks
 If this option is set to true, only visible layers are imported. For dgn import, this option is unsupported.
See Also
Reference
BaseImportOptions Class
Autodesk.Revit.DB Namespace